/* **************************************************************************
 * Copyright (C) 2009 koiroha.org All Right Reserved
 * **************************************************************************
 * This module, contains source code, binary and documentation, is in the
 * BSD License, and comes with NO WARRANTY.
 *
 *                                        takami torao <torao@mars.dti.ne.jp>
 *                                                     http://www.koiroha.org
 * $Id: Bus.java,v 1.5 2009/05/15 14:56:08 torao Exp $
*/
package org.koiroha.usb;

import java.util.List;

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Bus: バスインターフェース
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * バスを表すインターフェースです。このバスに接続しているデバイスの一覧を保持しています。
 * <p>
 * @version usb4j 1.0 $Revision: 1.5 $ $Date: 2009/05/15 14:56:08 $
 * @author torao
 * @since 2009/05/02 Java2 SE 5.0
 */
public interface Bus {

	// ======================================================================
	// バス名の参照
	// ======================================================================
	/**
	 * このバスの名前を参照します。この名前は人が認識するための文字列です。
	 * <p>
	 * @return バスの名前
	*/
	public String getName();

	// ======================================================================
	// デバイスの参照
	// ======================================================================
	/**
	 * このバスに接続してる全てのデバイスを参照します。
	 * <p>
	 * @return 接続しているデバイス
	*/
	public List<Device> getDevices();

	// ======================================================================
	// デバイスの参照
	// ======================================================================
	/**
	 * このバスのルートハブデバイスを参照します。USB 実装がデバイスのトポロジー構成に対応して
	 * いない場合は null を返します。
	 * <p>
	 * @return ルートハブデバイス
	*/
	public Device getRootHub();

}
