/* **************************************************************************
 * Copyright (C) 2009 koiroha.org All Right Reserved
 * **************************************************************************
 * This module, contains source code, binary and documentation, is in the
 * BSD License, and comes with NO WARRANTY.
 *
 *                                        takami torao <torao@mars.dti.ne.jp>
 *                                                     http://www.koiroha.org
 * $Id: Configuration.java,v 1.7 2009/05/18 20:34:12 torao Exp $
*/
package org.koiroha.usb;

import java.util.List;

import org.koiroha.usb.desc.*;

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Configuration: コンフィギュレーション
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * デバイスのコンフィギュレーションを表すインターフェースです。コンフィギュレーションに対する記述子
 * とインターフェースを持ちます。
 * <p>
 * @version usb4j 1.0 $Revision: 1.7 $ $Date: 2009/05/18 20:34:12 $
 * @author torao
 * @since 2009/04/23 Java2 SE 5.0
 * @see Device#setActiveConfiguration(int)
 */
public interface Configuration {

	// ======================================================================
	// コンフィギュレーション記述子の参照
	// ======================================================================
	/**
	 * このコンフィギュレーションの記述子を参照します。
	 * <p>
	 * @return コンフィギュレーション記述子
	 */
	public ConfigurationDescriptor getDescriptor();

	// ======================================================================
	// 追加記述子の参照
	// ======================================================================
	/**
	 * このコンフィギュレーションに設定されているクラス仕様/ベンダー仕様の記述子を参照します。
	 * <p>
	 * @return 追加の記述子
	 */
	public List<Descriptor> getAdditionalDescriptor();

	// ======================================================================
	// デバイスの参照
	// ======================================================================
	/**
	 * このコンフィギュレーションのデバイスを参照します。
	 * <p>
	 * @return デバイス
	 */
	public Device getDevice();

	// ======================================================================
	// インターフェースの参照
	// ======================================================================
	/**
	 * このコンフィギュレーションの全てのインターフェースを参照します。
	 * <p>
	 * @return インターフェースのリスト
	 */
	public List<Interface> getInterfaces();

}
