/* **************************************************************************
 * Copyright (C) 2009 koiroha.org All Right Reserved
 * **************************************************************************
 * This module, contains source code, binary and documentation, is in the
 * BSD License, and comes with NO WARRANTY.
 *
 *                                        takami torao <torao@mars.dti.ne.jp>
 *                                                     http://www.koiroha.org
 * $Id: LangID.java,v 1.4 2009/05/18 20:34:12 torao Exp $
*/
package org.koiroha.usb;


// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// LangID: 言語 ID
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * 文字列記述子の要求で使用する言語 ID を定義するクラスです。
 * <p>
 * @version $Revision: 1.4 $ $Date: 2009/05/18 20:34:12 $
 * @author takami torao
 * @since 2009/05/13 Java2 SE 5.0
 */
public final class LangID {

	// ======================================================================
	// プライマリ言語マスク
	// ======================================================================
	/**
	 * プライマリ言語のマスクです。
	 */
	private static final int PRIMARY_MASK = ((1 << 10) - 1);

	// ======================================================================
	// サブ言語マスク
	// ======================================================================
	/**
	 * サブ言語のマスクです。
	 */
	private static final int SUB_MASK = ((1 << 6) - 1);

	// ======================================================================
	// 言語 ID 識別値
	// ======================================================================

	/** 英語 (US) を表す言語 ID 定数 {@value} です。 */
	public static final short ENGLISH = 0x0409;

	/** 日本語を表す言語 ID 定数 {@value} です。 */
	public static final short JAPANESE = 0x0411;

	// ======================================================================
	// プライマリ言語の参照
	// ======================================================================
	/**
	 * 指定された言語 ID のプライマリ言語を参照します。プライマリ言語は方言や国ごとの変化を含ま
	 * ない言語識別値です。このメソッドは指定された {@code langid} の下位 10bit を返します。
	 * <p>
	 * @param langid 言語 ID
	 * @return プライマリ言語識別値
	 */
	public static int getPrimaryLanguage(int langid){
		return langid & PRIMARY_MASK;
	}

	// ======================================================================
	// サブ言語の参照
	// ======================================================================
	/**
	 * 指定された言語 ID のサブ言語を参照します。サブ言語は特定のプライマリ言語に対して方言や
	 * 国ごとの変化を表す 6bit 識別値です (通常 0x01 がその言語のデフォルト言語 ID を表して
	 * います)。
	 * <p>
	 * このメソッドは指定された {@code langid} の上位 6bit をシフトして返します。例えば
	 * {@code 0x0409} に対して {@code 0x01} を返します。
	 * <p>
	 * @param langid 言語 ID
	 * @return サブ言語識別値
	 */
	public static int getSubLanguage(int langid){
		return (langid >> 10) & SUB_MASK;
	}

	// ======================================================================
	// 言語 ID の参照
	// ======================================================================
	/**
	 * 指定されたプライマリ言語 (10bit)、サブ言語 (6bit) の値から言語 ID を参照します。
	 * <p>
	 * @param primary プライマリ言語
	 * @param sub サブ言語
	 * @return 言語 ID
	 */
	public static short getLangID(int primary, int sub){
		return (short)((primary & PRIMARY_MASK) | ((sub & SUB_MASK) << 10));
	}

}
